{
    "scenarios": [
        {"id": "unexpected_delay", "description": "An unforeseen delay forces you to wait and disrupts your schedule."},
        {"id": "personal_property_taken", "description": "Someone uses or removes your personal property without permission."},
        {"id": "critical_obligation_missed", "description": "You fail to fulfill a time‑sensitive duty or commitment."},
        {"id": "essential_item_unavailable", "description": "You cannot access or locate something you need immediately."},
        {"id": "hazardous_behavior_from_other", "description": "Another person’s reckless action endangers or inconveniences you."},
        {"id": "unexpected_resource_failure", "description": "A tool, service, or piece of technology stops working when required."},
        {"id": "commitment_revoked", "description": "An agreed‑upon plan or promise is canceled at short notice."},
        {"id": "public_mistake_exposure", "description": "Your error or shortcoming becomes visible to others."},
        {"id": "unforeseen_financial_burden", "description": "An unplanned cost arises that strains your budget."},
        {"id": "environmental_disruption", "description": "External conditions (noise, weather, etc.) prevent focus or rest."},    
        {"id": "communication_breakdown", "description": "You cannot reach someone or get a response when it is urgent to do so."},
        {"id": "authority_denial", "description": "A formal request or application is unexpectedly rejected by an official body or gatekeeper."},
        {"id": "schedule_overlap", "description": "Two or more commitments clash, forcing an immediate decision or cancellation."},
        {"id": "lost_opportunity", "description": "A beneficial chance or offer passes before you can act on it."},
        {"id": "misinformation_received", "description": "You act on incorrect information that later causes inconvenience or harm."},
        {"id": "resource_shortage", "description": "Necessary supplies or materials run out sooner than anticipated."},
        {"id": "physical_injury", "description": "A sudden minor injury or ailment limits your ability to carry out planned activities."},
        {"id": "social_exclusion", "description": "You are left out of a group activity or decision that matters to you."},
        {"id": "privacy_violation", "description": "Your personal or sensitive data is accessed or shared without consent."},
        {"id": "unexpected_responsibility", "description": "You are suddenly assigned additional duties beyond your regular workload."},
        {"id": "sudden_rule_change", "description": "Rules or requirements change abruptly, forcing you to adjust plans."},
        {"id": "payment_processing_issue", "description": "A payment fails or is delayed, postponing access to a product or service."},
        {"id": "queue_skipped", "description": "Another person bypasses an orderly queue, delaying your turn."},
        {"id": "service_unavailable", "description": "An expected service or facility is closed or offline without notice."},
        {"id": "public_transport_failure", "description": "Public transport breaks down or is canceled, leaving you searching for alternatives."},
        {"id": "incorrect_charge", "description": "You are billed the wrong amount for goods or services."},
        {"id": "lost_delivery", "description": "An important delivery or message goes missing before reaching you."},
        {"id": "credential_compromise", "description": "Your account credentials are breached, risking unauthorized access."},
        {"id": "unfair_criticism", "description": "You receive negative feedback you believe is unwarranted."},
        {"id": "overbooked_event", "description": "An event exceeds capacity, preventing your participation."},
        {"id": "weather_disruption", "description": "Unexpected weather conditions interfere with your plans."},
        {"id": "power_outage", "description": "Electricity suddenly goes out, disrupting normal activities."},
        {"id": "internet_disconnect", "description": "Your internet connection fails at a critical moment."},
        {"id": "data_loss", "description": "Important files or data are lost due to error or malfunction."},
        {"id": "time_zone_conflict", "description": "A misunderstanding about time zones causes a missed meeting or deadline."},
        {"id": "traffic_jam", "description": "Unexpected traffic significantly delays your travel."},
        {"id": "emergency_interruption", "description": "An urgent situation forces you to abandon what you were doing."},
        {"id": "healthcare_delay", "description": "Medical assistance or appointments are postponed when needed."},
        {"id": "overlooked_message", "description": "A critical message or email is missed or ignored."},
        {"id": "incorrect_order", "description": "An order arrives with the wrong items or specifications."},
        {"id": "access_denied", "description": "You cannot enter a location or system you expected to access."},
        {"id": "equipment_malfunction", "description": "A device or tool you depend on breaks unexpectedly."},
        {"id": "overhearing_conflict", "description": "You overhear negative remarks about yourself from others."},
        {"id": "public_transport_delay", "description": "Trains, buses, or flights are delayed beyond reasonable expectations."},
        {"id": "queue_exceeds_time", "description": "A line takes much longer than expected, delaying other plans."},
        {"id": "policy_confusion", "description": "Unclear or contradictory rules make it hard to proceed confidently."},
        {"id": "storage_limit_reached", "description": "You run out of space on a device or platform at a crucial time."},
        {"id": "tool_unavailability", "description": "An essential tool is not available when you need it most."},
        {"id": "unexpected_noise", "description": "A sudden loud or continuous noise disturbs your environment."},
        {"id": "unplanned_interruption", "description": "Someone interrupts your activity, forcing you to pause or restart."},
        {"id": "flight_canceled_last_minute", "description": "Your scheduled flight is abruptly canceled just before departure, stranding you at the airport."},
        {"id": "car_breakdown_commute", "description": "Your car breaks down on the way to an important appointment, leaving you stuck roadside."},
        {"id": "wallet_lost_travel", "description": "You misplace your wallet while traveling and have no immediate access to money or ID."},
        {"id": "coworker_takes_credit", "description": "A colleague publicly presents your work as their own without acknowledgment."},
        {"id": "pet_emergency", "description": "Your pet suddenly becomes ill and requires urgent veterinary care."},
        {"id": "bank_account_locked", "description": "Suspicious activity causes your bank to freeze your account when you need funds urgently."},
        {"id": "rumor_spread_friend", "description": "A friend spreads a false rumor about you, harming your reputation."},
        {"id": "document_left_home", "description": "You arrive at an official appointment only to realize mandatory documents were left at home."},
        {"id": "unexpected_rent_increase", "description": "Your landlord announces a significant rent hike with minimal notice."},
        {"id": "childcare_cancellation", "description": "Your childcare provider cancels hours before you are due at work, leaving you without coverage."},
        {"id": "meeting_canceled_no_notice", "description": "A critical meeting is canceled at the last minute without informing attendees in advance."},
        {"id": "surprise_guest_arrival", "description": "Unexpected visitors show up at your home, disrupting your plans."},
        {"id": "phone_stolen_public", "description": "Your phone is stolen while you are in a public place, cutting off communication."},
        {"id": "forced_system_update", "description": "Your computer forces a system update and restarts while you are working on something urgent."},
        {"id": "exam_schedule_change", "description": "The time or location of an exam is changed on short notice, risking your attendance."},
        {"id": "public_transport_strike", "description": "A strike halts public transport services, leaving you without your usual commuting option."},
        {"id": "parking_ticket_mistake", "description": "You receive a parking ticket even though you followed the posted rules and paid."},
        {"id": "important_email_spam", "description": "A vital email lands in your spam folder, causing you to miss an important deadline."},
        {"id": "booking_double_charged", "description": "Your credit card is charged twice for the same reservation or purchase."},
        {"id": "security_checkpoint_delay", "description": "Extra screening at a security checkpoint creates a delay that jeopardizes a tight connection."},
        {"id": "alarm_failure", "description": "Your morning alarm fails to sound, causing you to oversleep."},
        {"id": "password_lockout", "description": "Repeated wrong passwords lock you out of an important account."},
        {"id": "card_left_home", "description": "You reach checkout and discover your payment card is missing."},
        {"id": "seat_occupied", "description": "Someone is in the seat assigned to you, forcing an awkward dispute."},
        {"id": "elevator_stuck", "description": "The elevator halts between floors and the doors won’t open."},
        {"id": "printer_out_of_ink", "description": "A printer runs out of ink halfway through printing urgent documents."},
        {"id": "car_battery_dead", "description": "Your car won’t start because the battery is completely drained."},
        {"id": "photo_deleted", "description": "You accidentally delete an important photo before it is backed up."},
        {"id": "package_theft", "description": "A delivered parcel is stolen from your doorstep before you retrieve it."},
        {"id": "phone_dead_urgent", "description": "Your phone battery dies just when you need to make an urgent call."},
        {"id": "door_key_breaks", "description": "Your key snaps off in the lock, leaving you locked out."},
        {"id": "payment_terminal_down", "description": "A store’s card reader is offline, preventing you from paying."},
        {"id": "coffee_spill_on_device", "description": "You knock over a drink onto your laptop, risking data loss."},
        {"id": "meeting_link_invalid", "description": "The video‑call link for a scheduled meeting fails to open."},
        {"id": "backup_drive_corrupted", "description": "An external backup drive becomes unreadable when you need files."},
        {"id": "fire_drill_interrupt", "description": "A workplace fire drill forces you to pause an urgent task."},
        {"id": "smoke_alarm_low_battery", "description": "A smoke alarm chirps repeatedly at night due to low battery."},
        {"id": "ride_hailing_no_show", "description": "A ride‑share driver cancels after the pickup time, leaving you stranded."},
        {"id": "auto_update_data_cap", "description": "A phone app auto‑updates on cellular, exhausting your data plan."},
        {"id": "wardrobe_malfunction_public", "description": "Clothing tears or fails in public, causing embarrassment."},
        {"id": "unsaved_work_loss", "description": "Your software crashes before you save, erasing recent progress."},
        {"id": "card_declined_fraud", "description": "A legitimate purchase is declined because your bank flags it as suspicious."},
        {"id": "oversold_flight_denied_boarding", "description": "You are bumped from an oversold flight despite having a confirmed ticket."},
        {"id": "parking_lot_full", "description": "You arrive and find the parking lot full, forcing you to search for alternate parking."},
        {"id": "atm_cash_unavailable", "description": "An ATM runs out of cash just as you need to withdraw money."},
        {"id": "important_call_drop", "description": "A crucial phone call disconnects mid‑conversation due to weak signal."},
        {"id": "bluetooth_disconnect_audio", "description": "Your wireless audio device disconnects mid‑call, cutting off communication."},
        {"id": "food_order_missing_item", "description": "A takeaway or delivery meal arrives with a key item missing."},
        {"id": "access_card_malfunction", "description": "Your building access card suddenly stops working, locking you out."},
        {"id": "printer_paper_jam", "description": "A printer jams while producing time‑sensitive documents."},
        {"id": "friend_forgets_birthday", "description": "A close friend forgets your birthday, offering no greeting or acknowledgment."},
        {"id": "coworker_interrupts_presentation", "description": "A colleague repeatedly cuts you off while you are presenting to the team."},
        {"id": "stranger_spills_coffee", "description": "A passerby bumps into you, spilling your drink, then walks away without apologizing."},
        {"id": "idea_ignored_meeting", "description": "You share a suggestion in a group meeting and everyone moves on without addressing it."},
        {"id": "neighbor_loud_music_midnight", "description": "Your neighbor blasts loud music late at night, disturbing your sleep."},
        {"id": "date_late_no_message", "description": "Someone you are meeting for a date arrives very late without notifying you."},
        {"id": "group_chat_exclusion", "description": "Coworkers start a new team chat and leave you out of important discussions."},
        {"id": "movie_spoiled", "description": "A friend reveals a key plot twist of a film you planned to watch soon."},
        {"id": "seat_recline_invasion", "description": "The passenger in front of you reclines their seat abruptly, encroaching on your limited space."},
        {"id": "unflattering_photo_posted", "description": "An acquaintance posts an unflattering photo of you on social media without permission."},
        {"id": "friend_ghosts_message", "description": "A friend reads your text but never replies, leaving you uncertain."},
        {"id": "coworker_micromanages_task", "description": "A colleague continually tells you how to do a task you already know well."},
        {"id": "loud_call_quiet_zone", "description": "Someone speaks loudly on a phone in a designated quiet area, disturbing others."},
        {"id": "walkway_blocked_strangers", "description": "Strangers stop to chat in the middle of a pathway, blocking your passage."},
        {"id": "name_mispronounced_repeat", "description": "After correction, someone keeps mispronouncing your name."},
        {"id": "bill_split_unfair", "description": "At a group meal, others insist on splitting the bill evenly though you ordered less."},
        {"id": "social_event_overlook", "description": "You learn friends held a gathering without inviting you."},
        {"id": "private_message_forwarded", "description": "A coworker forwards your private email to others without permission."},
        {"id": "roommate_shared_space_mess", "description": "Your roommate leaves common areas messy and doesn't clean up."},
        {"id": "unannounced_visit_friend", "description": "A friend arrives at your home without notice, disrupting your plans."},
        {"id": "conversation_hijacked", "description": "Someone abruptly changes the subject while you’re speaking, sidelining your point."},
        {"id": "inside_joke_exclusion", "description": "People around you share inside jokes that make you feel left out of the conversation."},
        {"id": "name_forgotten_introduction", "description": "During an introduction, the person forgets your name or gets it wrong."},
        {"id": "backhanded_compliment", "description": "A so‑called compliment actually contains an insult about you."},
        {"id": "unwanted_photo_tag", "description": "You are tagged in a social‑media photo you dislike without being asked."},
        {"id": "joke_at_your_expense", "description": "Friends make a joke that targets you, causing discomfort."},
        {"id": "group_plans_changed_last_minute", "description": "Friends move a gathering’s time or place without checking if you can still attend."},
        {"id": "ignored_handshake", "description": "You extend a handshake but the other person ignores it."},
        {"id": "distracted_listener", "description": "Someone scrolls on their phone while you are talking, giving little attention."},
        {"id": "broken_favor_promise", "description": "A friend who promised to help you backs out at the last moment."},
        {"id": "friend_borrowed_item_not_returned", "description": "A friend borrows your book and never returns it after the agreed time."},
        {"id": "coworker_eats_lunch", "description": "A coworker eats your clearly labeled lunch from the office fridge."},
        {"id": "partner_reads_private_messages", "description": "Your partner goes through your private messages without permission."},
        {"id": "stranger_takes_reserved_seat", "description": "A stranger sits in your reserved train seat and refuses to move."},
        {"id": "unsolicited_advice_acquaintance", "description": "An acquaintance offers personal advice you didn’t ask for."},
        {"id": "group_chat_misunderstanding", "description": "Your group‑chat message is misread, sparking an argument."},
        {"id": "loud_video_public_space", "description": "Someone plays a video on speaker in a quiet waiting area."},
        {"id": "friend_arrives_extremely_late", "description": "A friend shows up over an hour late to a meetup without notice."},
        {"id": "friend_unfollow_social", "description": "You discover a close friend has unfollowed you on social media without explanation."},
        {"id": "neighbor_smokes_hallway", "description": "A neighbor smokes outside your door, filling your hallway with smoke."},
        {"id": "boss_revokes_approved_leave", "description": "Your manager cancels your previously approved vacation days at short notice."},
        {"id": "unexpected_external_attendee", "description": "A person you don’t know is invited to a meeting and hears confidential details."},
        {"id": "partner_forgets_joint_plan", "description": "Your partner forgets a date night you planned together and makes other plans."},
        {"id": "project_teammate_no_show", "description": "A teammate contributes nothing to a group project, leaving extra work for you."},
        {"id": "stranger_intrusive_question", "description": "A stranger asks a deeply personal question that makes you uncomfortable."},
        {"id": "unsolicited_physical_contact", "description": "An acquaintance touches your hair or body without permission."},
        {"id": "stranger_photographs_without_consent", "description": "Someone takes your photo in public without asking."},
        {"id": "language_exclusion_laughter", "description": "Colleagues switch to a language you don’t understand and laugh together."},
        {"id": "coworker_reply_all_mistake", "description": "A coworker accidentally replies‑all with sensitive information to a large mailing list."},
        {"id": "inappropriate_appearance_comment", "description": "Someone makes an invasive comment about your appearance that feels uncomfortable."},
        {"id": "supervisor_publicly_scolds", "description": "Your supervisor criticizes your work loudly in front of the whole team."},
        {"id": "coworker_ignores_email", "description": "A colleague repeatedly ignores your emails about an urgent shared task."},
        {"id": "friend_shares_confidential_info", "description": "A friend tells others a secret you asked them to keep private."},
        {"id": "neighbor_blocks_driveway", "description": "A neighbor parks across your driveway, preventing you from leaving."},
        {"id": "acquaintance_name_mixup", "description": "Someone you’ve met several times still calls you by the wrong name."},
        {"id": "parent_publicly_embarrasses", "description": "A parent makes a personal remark about you in front of your friends."},
        {"id": "teammate_blames_mistake", "description": "A project teammate blames their error on you during a group review."},
        {"id": "event_host_forgets_dietary_restriction", "description": "A host serves food you cannot eat despite being told your restriction."},
        {"id": "child_interrupts_video_call", "description": "A child bursts into the room during your important video meeting."},
        {"id": "coworker_reschedules_meeting_without_consult", "description": "A colleague moves a meeting time without checking your availability."},
        {"id": "romantic_partner_on_phone_dinner", "description": "Your partner scrolls on their phone through an entire dinner date."},
        {"id": "customer_service_hangup", "description": "A support agent hangs up mid‑call before resolving your issue."},
        {"id": "gossip_spread_workplace", "description": "A rumor about you circulates in the office without your knowledge."},
        {"id": "stranger_invades_personal_space", "description": "Someone stands uncomfortably close in a queue despite room to spread out."},
        {"id": "stranger_takes_up_two_seats", "description": "A passenger uses two bus seats, leaving others standing."},
        {"id": "seat_kicked_repeat", "description": "The person behind you keeps kicking your seat throughout a flight."},
        {"id": "coworker_plays_music_no_headphones", "description": "A coworker blasts music from their speakers in an open office."},
        {"id": "friend_changes_story_blames_you", "description": "A friend alters a shared story to make you appear at fault."},
        {"id": "neighbor_dog_barks_night", "description": "A neighbor’s dog barks loudly through the night, disrupting sleep."},
        {"id": "colleague_takes_last_cup_coffee", "description": "A coworker finishes the office coffee and leaves the pot empty."},
        {"id": "mentor_last_minute_feedback", "description": "A mentor returns substantial edits minutes before a deadline."},
        {"id": "sibling_borrows_clothes_spill", "description": "A sibling borrows your clothes and returns them with a stain."},
        {"id": "social_media_comment_misunderstood", "description": "Your online comment is misinterpreted, sparking hostile replies."},
        {"id": "group_task_skipped_turn", "description": "Team members move ahead without giving you your turn to contribute."},
        {"id": "landlord_enters_without_notice", "description": "Your landlord enters your apartment unannounced while you’re home."},
        {"id": "ride_share_driver_detours", "description": "A ride‑share driver takes a long detour without explaining why."},
        {"id": "stranger_blocking_photo_spot", "description": "Tourists occupy a photo spot for too long, preventing your picture."},
        {"id": "colleague_forwards_wrong_attachment", "description": "A coworker sends the wrong confidential file to the entire team."},
        {"id": "friend_cancels_trip_after_booking", "description": "A friend cancels a joint trip after tickets are non‑refundable."},
        {"id": "supermarket_cart_collision", "description": "Another shopper rams your cart and walks off without apology."},
        {"id": "shoe_lace_snaps", "description": "Your shoelace snaps while you are tying it, forcing a knot-on-the-go."},
        {"id": "pen_runs_out_mid_exam", "description": "Your pen dries up halfway through writing an exam answer."},
        {"id": "elevator_full_turn_away", "description": "The elevator arrives packed, so you must wait for the next one."},
        {"id": "email_no_attachment", "description": "You send an email, then realize you forgot to attach the promised file."},
        {"id": "voice_cracks_presentation", "description": "Your voice cracks audibly during an important presentation line."},
        {"id": "message_wrong_chat", "description": "You post a private message in the wrong group chat by mistake."},
        {"id": "friend_talks_during_movie", "description": "A friend keeps chatting during a film despite polite hints to stop."},
        {"id": "vending_machine_eats_coin", "description": "A vending machine takes your money but doesn’t dispense the item."},
        {"id": "zipper_stuck_coat", "description": "Your coat zipper jams halfway up, trapping you inside the coat."},
        {"id": "seat_taken_reservation", "description": "Someone is sitting in your pre‑assigned seat and hesitates to move."},
        {"id": "card_reader_contactless_fail", "description": "A tap‑to‑pay terminal refuses multiple attempts, forcing you to swipe."},
        {"id": "autocorrect_wrong_name", "description": "Phone autocorrect changes someone’s name, sending an awkward text."},
        {"id": "stapler_out_of_staples", "description": "The stapler clicks but no staple comes out when compiling papers."},
        {"id": "bookmark_fell_out", "description": "Your bookmark slips out, losing the exact page you left off."},
        {"id": "printers_ink_smudge", "description": "Freshly printed pages smear ink on your hands and documents."},
        {"id": "coffee_machine_no_beans", "description": "The office coffee machine flashes empty‑bean warning at brew time."},
        {"id": "seatbelt_latch_jammed", "description": "A car seatbelt won’t click into its latch, delaying departure."},
        {"id": "social_media_unwanted_tag", "description": "Someone tags you in a post you’d prefer to stay anonymous in."},
        {"id": "phone_dead_important_call", "description": "Your phone battery dies seconds before an expected call."},
        {"id": "wifi_guest_password_missing", "description": "Guests arrive but you can’t recall the Wi‑Fi password for them."},
        {"id": "roommate_leaves_light_on", "description": "A roommate leaves every light on after leaving home."},
        {"id": "friend_owes_money_unpaid", "description": "A friend promises reimbursement but still hasn’t paid you back."},
        {"id": "loud_sneeze_quiet_room", "description": "You sneeze loudly during a silent moment in a lecture hall."},
        {"id": "cupboard_handle_breaks", "description": "A cupboard handle snaps off in your hand while opening it."},
        {"id": "usb_cable_frayed", "description": "Your charging cable frays, causing intermittent power connection."},
        {"id": "printer_overwrites_file", "description": "A shared printer queue replaces your document with someone else’s."},
        {"id": "stranger_steps_on_shoe", "description": "A passerby steps on your heel, scuffing your shoe without apology."},
        {"id": "dog_leash_slips_hand", "description": "Your dog’s leash slips from your grasp for a moment in the park."},
        {"id": "friend_hiccups_speech", "description": "A fit of hiccups interrupts you mid‑sentence while speaking publicly."},
        {"id": "flashlight_battery_dead", "description": "A flashlight won’t turn on because the batteries died unexpectedly."},
        {"id": "mouse_low_battery", "description": "Your wireless mouse stops responding during detailed design work."},
        {"id": "cash_register_no_change", "description": "A cashier runs out of small bills and can’t give proper change."},
        {"id": "microwave_cold_center", "description": "Microwaved food is hot outside but still cold in the middle."},
        {"id": "parking_meter_card_error", "description": "A parking meter rejects your card repeatedly, risking a ticket."},
        {"id": "child_spills_water_counter", "description": "A child accidentally knocks a full glass of water across the table."},
        {"id": "sink_clogs_after_dinner", "description": "Kitchen sink water backs up right after washing dishes."},
        {"id": "file_download_stuck", "description": "A large file stalls at 99 % completion and never finishes."},
        {"id": "sibling_borrows_charger_missing", "description": "Your charger disappears after a sibling borrows it."},
        {"id": "ride_share_no_show", "description": "Your ride‑share driver accepts and then cancels as pickup time arrives."},
        {"id": "bluetooth_disconnect_headset", "description": "Wireless headphones drop connection mid‑conference call."},
        {"id": "bus_pass_misplaced", "description": "You reach the station and realize your transit card is missing."},
        {"id": "library_book_reserved", "description": "A book you need is recalled the day after you check it out."},
        {"id": "dish_slips_sink_breaks", "description": "A plate slips from your hands and shatters in the sink."},
        {"id": "toothbrush_bristles_fall", "description": "Bristles shed from your toothbrush while brushing."},
        {"id": "printer_toner_low_streaks", "description": "Low toner causes streaks across an important printout."},
        {"id": "sock_wet_in_puddle", "description": "You step in a puddle and soak one sock on the way to work."},
        {"id": "meeting_mute_left_on", "description": "You speak for several seconds on a video call while still muted."},
        {"id": "spam_call_interrupts_focus", "description": "A robocall rings right as you enter a focused workflow."},
        {"id": "weather_app_wrong_temp", "description": "The weather app forecasts sun but it starts raining unexpectedly."},
        {"id": "food_overcooks_burns", "description": "Food in the oven burns after you misread the timer."},
        {"id": "wallet_falls_gap_seat", "description": "Your wallet slips between car seats, making it hard to retrieve."}
    ]
}
            