{
    "scenarios": [
        {"id": "unexpected_delay", "description": "An unforeseen delay forces you to wait and disrupts your schedule."},
        {"id": "personal_property_taken", "description": "Someone uses or removes your personal property without permission."},
        {"id": "critical_obligation_missed", "description": "You fail to fulfill a time‑sensitive duty or commitment."},
        {"id": "essential_item_unavailable", "description": "You cannot access or locate something you need immediately."},
        {"id": "hazardous_behavior_from_other", "description": "Another person’s reckless action endangers or inconveniences you."},
        {"id": "unexpected_resource_failure", "description": "A tool, service, or piece of technology stops working when required."},
        {"id": "commitment_revoked", "description": "An agreed‑upon plan or promise is canceled at short notice."},
        {"id": "public_mistake_exposure", "description": "Your error or shortcoming becomes visible to others."},
        {"id": "unforeseen_financial_burden", "description": "An unplanned cost arises that strains your budget."},
        {"id": "environmental_disruption", "description": "External conditions (noise, weather, etc.) prevent focus or rest."},    
        {"id": "communication_breakdown", "description": "You cannot reach someone or get a response when it is urgent to do so."},
        {"id": "authority_denial", "description": "A formal request or application is unexpectedly rejected by an official body or gatekeeper."},
        {"id": "schedule_overlap", "description": "Two or more commitments clash, forcing an immediate decision or cancellation."},
        {"id": "lost_opportunity", "description": "A beneficial chance or offer passes before you can act on it."},
        {"id": "misinformation_received", "description": "You act on incorrect information that later causes inconvenience or harm."},
        {"id": "resource_shortage", "description": "Necessary supplies or materials run out sooner than anticipated."},
        {"id": "physical_injury", "description": "A sudden minor injury or ailment limits your ability to carry out planned activities."},
        {"id": "social_exclusion", "description": "You are left out of a group activity or decision that matters to you."},
        {"id": "privacy_violation", "description": "Your personal or sensitive data is accessed or shared without consent."},
        {"id": "unexpected_responsibility", "description": "You are suddenly assigned additional duties beyond your regular workload."},
        {"id": "sudden_rule_change", "description": "Rules or requirements change abruptly, forcing you to adjust plans."},
        {"id": "payment_processing_issue", "description": "A payment fails or is delayed, postponing access to a product or service."},
        {"id": "queue_skipped", "description": "Another person bypasses an orderly queue, delaying your turn."},
        {"id": "service_unavailable", "description": "An expected service or facility is closed or offline without notice."},
        {"id": "public_transport_failure", "description": "Public transport breaks down or is canceled, leaving you searching for alternatives."},
        {"id": "incorrect_charge", "description": "You are billed the wrong amount for goods or services."},
        {"id": "lost_delivery", "description": "An important delivery or message goes missing before reaching you."},
        {"id": "credential_compromise", "description": "Your account credentials are breached, risking unauthorized access."},
        {"id": "unfair_criticism", "description": "You receive negative feedback you believe is unwarranted."},
        {"id": "overbooked_event", "description": "An event exceeds capacity, preventing your participation."},
        {"id": "weather_disruption", "description": "Unexpected weather conditions interfere with your plans."},
        {"id": "power_outage", "description": "Electricity suddenly goes out, disrupting normal activities."},
        {"id": "internet_disconnect", "description": "Your internet connection fails at a critical moment."},
        {"id": "data_loss", "description": "Important files or data are lost due to error or malfunction."},
        {"id": "time_zone_conflict", "description": "A misunderstanding about time zones causes a missed meeting or deadline."},
        {"id": "traffic_jam", "description": "Unexpected traffic significantly delays your travel."},
        {"id": "emergency_interruption", "description": "An urgent situation forces you to abandon what you were doing."},
        {"id": "healthcare_delay", "description": "Medical assistance or appointments are postponed when needed."},
        {"id": "overlooked_message", "description": "A critical message or email is missed or ignored."},
        {"id": "incorrect_order", "description": "An order arrives with the wrong items or specifications."},
        {"id": "access_denied", "description": "You cannot enter a location or system you expected to access."},
        {"id": "equipment_malfunction", "description": "A device or tool you depend on breaks unexpectedly."},
        {"id": "overhearing_conflict", "description": "You overhear negative remarks about yourself from others."},
        {"id": "public_transport_delay", "description": "Trains, buses, or flights are delayed beyond reasonable expectations."},
        {"id": "queue_exceeds_time", "description": "A line takes much longer than expected, delaying other plans."},
        {"id": "policy_confusion", "description": "Unclear or contradictory rules make it hard to proceed confidently."},
        {"id": "storage_limit_reached", "description": "You run out of space on a device or platform at a crucial time."},
        {"id": "tool_unavailability", "description": "An essential tool is not available when you need it most."},
        {"id": "unexpected_noise", "description": "A sudden loud or continuous noise disturbs your environment."},
        {"id": "unplanned_interruption", "description": "Someone interrupts your activity, forcing you to pause or restart."}
    ]
  }
  