[
  {
    "story": "The airplane model that Wang made fell from the sky one minute after take-off. When she inspected the model, she found a part that could possibly be improved. At this moment, she would feel:",
    "options": [
      "Expectation",
      "Excited",
      "Joyful",
      "Frustrated"
    ]
  },
  {
    "story": "Although Aunt Li pays close attention to her lifestyle and diet, she still got a malignant tumor. The chances of curing the tumor now are quite slim, and Aunt Li can do nothing about it. She would feel:",
    "options": [
      "Desperation",
      "Fear",
      "Helpless",
      "Sad"
    ]
  },
  {
    "story": "During the Mathematical Olympiad, the last question was very difficult and Xu failed to solve it. After the exam, he was still struggling to figure it out. Suddenly, a light bulb went on in his head, and he thought of a solution. At this moment, he would feel:",
    "options": [
      "Regretted",
      "Excited",
      "Frustrated",
      "Proud"
    ]
  },
  {
    "story": "During the lunch break, Li listened to a story about an athlete who broke the world record. This athlete, although physically disabled, was determined, trained hard, overcame numerous difficulties, and finally won the championship for the national team. Li would feel:",
    "options": [
      "Touched",
      "Ashamed",
      "Proud",
      "Joyful"
    ]
  },
  {
    "story": "Dad asked Pan to score 80 on the final exam. Otherwise, he would be punished. After the exam, Pan felt that he could only score up to 70. He would feel:",
    "options": [
      "Anxiety",
      "Fear",
      "Nervous",
      "Frustrated"
    ]
  },
  {
    "story": "Wang was eating in the canteen and found the food very unpalatable. Just then, he received a parcel from his mother containing his favorite food. He would feel:",
    "options": [
      "Love",
      "Touched",
      "Joyful",
      "Surprised"
    ]
  },
  {
    "story": "Hu is transferring to another school. Her classmates held a grand farewell party for her. She would feel:",
    "options": [
      "Touched",
      "Sad",
      "Love",
      "Joyful"
    ]
  },
  {
    "story": "Uncle Wu was extremely worried about his health and went to the hospital for a comprehensive medical check-up. The doctor informed him that his check-up results showed that he was in good health. Uncle Wu would feel:",
    "options": [
      "Relaxed",
      "Joyful",
      "Doubtful",
      "Expectant"
    ]
  },
  {
    "story": "Ming did not win any prizes in the mathematics competition, but his parents did not blame him and still bought him the guitar he had been longing for. Ming would feel:",
    "options": [
      "Ashamed",
      "Love",
      "Joyful",
      "Surprised"
    ]
  },
  {
    "story": "On his way home from school, Zhang noticed several people holding sticks and attempting to capture a dog. The dog had already been hit several times and was dying. Zhang would feel:",
    "options": [
      "Angry",
      "Sympathetic",
      "Disgusted",
      "Sad"
    ]
  },
  {
    "story": "Li saw an elderly lady fall on the side of the road and he quickly went up to help. However, the elderly lady insisted that it was Li who had knocked her over, and the court ruled Li to pay 100,000 yuan for the medical expenses. Li would feel:",
    "options": [
      "Angry",
      "Disgusted",
      "Disappointed",
      "Regretful"
    ]
  },
  {
    "story": "Fifty years ago, Grandpa Li went to the United States and has not returned since. Today, he tasted the water-milled rice cakes he had eaten as a child and kept saying, 'This is the taste I remember!' He would feel:",
    "options": [
      "Satisfied",
      "Nostalgic",
      "Joyful",
      "Excited"
    ]
  },
  {
    "story": "Lin is participating in a 1000-meter long-distance running race and maintaining first place. As he neared the finish line, another runner suddenly raced ahead and overtook him. He would feel:",
    "options": [
      "Angry",
      "Discouraged",
      "Surprised",
      "Annoyed"
    ]
  },
  {
    "story": "Cao was rushing to get home to watch the soccer match at 8 pm. But he didn't arrive until 9 pm. However, when he turned on the TV, he found that the match had been delayed and was just about to start. He would feel:",
    "options": [
      "Puzzled",
      "Joyful",
      "Excited",
      "Surprised"
    ]
  },
  {
    "story": "When Yang saw on the TV news that a 5-magnitude earthquake had occurred in her parents' city, she immediately called her parents and found out that the tremor was felt in their area, but the situation in their area was not serious. She would feel:",
    "options": [
      "Fortunate",
      "Relieved",
      "Worried",
      "Love"
    ]
  },
  {
    "story": "Ri's small restaurant has been experiencing declining business lately, with fewer and fewer customers. He ran a 'buy one, get one free' promotion, but it had almost no effect, as the number of customers was still decreasing. He couldn't figure out why. Ri would feel:",
    "options": [
      "Surprised",
      "Worried",
      "Discouraged",
      "Puzzled"
    ]
  },
  {
    "story": "Li organized a party and invited several of his best friends. Suddenly, one of his friends stepped out to answer a phone call and returned appearing downcast, without disclosing what had happened. Li would feel:",
    "options": [
      "Worried",
      "Puzzled",
      "Awkward",
      "Surprised"
    ]
  },
  {
    "story": "Hui is preparing to go abroad for university. She is packing up the luggage with her parents. By chance, she overhears her parents discussing that they don't want her to go abroad, as they are reluctant to see her leave. Hui would feel:",
    "options": [
      "Expectant",
      "Love",
      "Annoyed",
      "Sad"
    ]
  },
  {
    "story": "Tang drove his new car, taking some friends to the mountains. On the way, the car suddenly ran out of fuel. Tang suggested his friends wait there while he borrowed another vehicle and went to the nearest petrol station for fuel. However, one of his friends disagreed with Tang's plan, but he couldn't offer a better solution. Tang would feel:",
    "options": [
      "Helpless",
      "Annoyed",
      "Disgusted",
      "Angry"
    ]
  },
  {
    "story": "Nian presented his previously completed work in front of all the teachers and classmates. He was unsure whether they would appreciate the work, so he asked for everyone's opinions after the presentation but received no responses. At this time, Nian would feel:",
    "options": [
      "Embarrassed",
      "Puzzled",
      "Disheartened",
      "Nervous"
    ]
  },
  {
    "story": "Yang asked his father to install a swing in the yard of their house, but his father told him to do it himself. Therefore, Yang and some of his buddies put in a collective effort and finally installed a swing in the yard. Yang would feel:",
    "options": [
      "Proud",
      "Satisfied",
      "Joyful",
      "Excited"
    ]
  },
  {
    "story": "Han did not receive any notifications about the scholarship application, which made her miss the first round of scholarship applications. However, when she consulted her teacher, she was told she could apply for the second round. She would feel:",
    "options": [
      "Fortunate",
      "Expectant",
      "Joyful",
      "Relieved"
    ]
  },
  {
    "story": "During the class president election, Yun wanted to run for the position but felt she wasn't competent enough, so she did not participate in the election. In the end, someone whom she believed to be less capable than her later won the position of class president. Yun would feel:",
    "options": [
      "Regretted",
      "Angry",
      "Surprised",
      "Frustrated"
    ]
  },
  {
    "story": "Lin, a medical intern, disagreed with a treatment plan proposed by his senior doctor because he had read in an authoritative article that such treatment could be quite harmful to this kind of patient. However, the senior doctor, who had applied this treatment to other patients before without any problem, told him to proceed. Lin would feel:",
    "options": [
      "Surprised",
      "Contempt",
      "Frustrated",
      "Angry"
    ]
  },
  {
    "story": "Li and his friend attended a summer camp where they had to deliver a presentation together. Being shy, Li volunteered to collect information. But with his friend's throat hurting, Li ended up having to present on stage by himself. Li would feel:",
    "options": [
      "Nervous",
      "Fear",
      "Annoyed",
      "Expectant"
    ]
  },
  {
    "story": "Lei's team performs extraordinarily well, outperforming other teams each quarter. However, the company suddenly decides to have them work on a project with another team whose working quality is very poor. Lei would feel:",
    "options": [
      "Worried",
      "Helpless",
      "Angry",
      "Disgusted"
    ]
  },
  {
    "story": "Han has been living abroad for 15 years. Recently, she returned to her hometown and found that everything had changed. She would feel:",
    "options": [
      "Surprised",
      "Excited",
      "Proud",
      "Expectant"
    ]
  },
  {
    "story": "Today is the day when the results of the mid-term exams are released, and the names of the top 100 students will be publicly displayed. Liu feels that he performed particularly well in this exam and believes his name should be on the list. However, after checking the list from top to bottom, he failed to find his name. Li would feel:",
    "options": [
      "Disappointed",
      "Surprised",
      "Puzzled",
      "Frustrated"
    ]
  },
  {
    "story": "Li belongs to a very harmonious family, and he is very close to his family members. Recently, he received a great job offer, but it is in another city. Lei would feel:",
    "options": [
      "Torn",
      "Expectant",
      "Worried",
      "Joyful"
    ]
  },
  {
    "story": "Rui learned that their company might be heading for trouble, and he fears his job might be in jeopardy. But the company officially denied this. Rui would feel:",
    "options": [
      "Worried",
      "Confused",
      "Relieved",
      "Joyful"
    ]
  },
  {
    "story": "Zhao had just transitioned to high school. He casually walked around campus, wandered into the archives, and looked through materials at will. As a result, he was disciplined by the school because unauthorized access to the archives was strictly forbidden, but he was not aware of this when he entered. He would feel:",
    "options": [
      "Wronged",
      "Regretted",
      "Angry",
      "Dejected"
    ]
  },
  {
    "story": "Hua lives in a large family that always lives together in a large compound. He is about to move into a new home and wants to invite all the family members to celebrate in his new home. He would feel:",
    "options": [
      "Joyful",
      "Love",
      "Expectant",
      "Proud"
    ]
  },
  {
    "story": "Li's mathematics teacher is very strict and punctual. This morning, Li was half an hour late for his mathematics class, but the teacher did not say anything. Li would feel:",
    "options": [
      "Surprised",
      "Confused",
      "Ashamed",
      "Fear"
    ]
  },
  {
    "story": "Wang participated in a mathematics competition but felt he had not performed to his full potential. However, when the results were announced, he found that he was in a position of top 10. He would feel:",
    "options": [
      "Surprised",
      "Joyful",
      "Puzzled",
      "Proud"
    ]
  },
  {
    "story": "After the college entrance exam, Wen learned that his grandfather had passed away a week ago. His parents did not tell him to avoid affecting his college entrance exams. He would feel:",
    "options": [
      "Sad",
      "Regretted",
      "Angry",
      "Surprised"
    ]
  },
  {
    "story": "On his way to school, Li saw a car hit a little boy and then drove away without stopping. Li would feel:",
    "options": [
      "Angry",
      "Sad",
      "Disgusted",
      "Surprised"
    ]
  },
  {
    "story": "Wu found that a few students were cheating on the exam, but the teacher seemed indifferent. After the exam, those students were still smug about their actions. Wu would feel:",
    "options": [
      "Angry",
      "Disgusted",
      "Contempt",
      "Surprised"
    ]
  },
  {
    "story": "Xu bought a magazine while waiting for the bus. Coincidentally, there was a report on a writer she liked very much who had plagiarized, and the report provided irrefutable evidence. Xu would feel:",
    "options": [
      "Disappointed",
      "Surprised",
      "Angry",
      "Contempt"
    ]
  },
  {
    "story": "Han and his classmate went to a stationery shop to buy stationery. He unexpectedly noticed that his classmate had secretly taken some stationery from the shop and put it in his pocket. Han would feel:",
    "options": [
      "Surprised",
      "Disappointed",
      "Embarrassed",
      "Disgusted"
    ]
  },
  {
    "story": "Zheng and her friend had arranged to watch a movie together, but her friend was not punctual. By the time her friend arrived, they had already missed the movie, and yet her friend didn't even offer an apology. Zheng would feel:",
    "options": [
      "Disappointed",
      "Angry",
      "Disgusted",
      "Frustrated"
    ]
  }
]