{
    "examples": [
        "My friend Simon, an amateur painter, had been working on a portrait of his deceased pet for over a week. After he finally completed it, he stepped back and immediately noticed that he had painted the wrong color for his pet's fur. Just then, his wife saw it and exclaimed, That's exactly how I remember him! I was randomly reminded of this today when I was looking at a picture of my own dog.",
        "After months of voice-training, Lena finally nailed the high note in her late father’s favorite song and recorded it for a memorial video. That evening, she accidentally deleted the file. Distraught, she collapsed on the couch—only to realize that an old answering-machine tape, still sitting in the player, held a snippet of her dad humming the same melody (off-key, but joyfully). She played it on loop, crying and laughing as the house filled with their unfinished duet.",
        "For their tenth anniversary, June planned to give her partner a sealed envelope containing snippets of love letters she’d written but never dared to send during their early friendship. The night before, she accidentally left the envelope on the train. Heartbroken, she tried to rewrite them from memory, but the words felt forced. Two weeks later, a package arrived: a rail conductor had found the envelope and mailed it back, adding a short note—“Couldn’t help reading. Reminded me to phone my ex-wife.”",
        "During a business presentation, Aisha’s phone suddenly blared an old cartoon theme song—her late brother’s favorite ringtone she thought she’d deleted years ago. Embarrassed, she silenced it and apologized. After the meeting, the client admitted he’d recognized the tune and that it had been his daughter’s lullaby during a long hospital stay. What began as a mortifying interruption turned into an hour-long conversation about grief, resilience, and goofy childhood shows.",
        "I skipped my college graduation because money’s tight, right? So I’m thinking it’s just another Saturday. My little brother drags me downtown ‘for lunch.’ We turn the corner and my family’s built this cardboard stage with a fake podium—caps, gowns, everything. They call my name, hand me a printer-paper diploma, and even some random tourists cheer. I laughed so hard I forgot every ounce of stress from the past four years.",
        "Last week my beagle, Max, Houdini-ed his way out of the yard. I spent the whole weekend making ‘Missing Dog’ flyers, total mess. Monday on my walk to school, I hear barking and see my entire class marching toward me, each kid holding a sign like ‘Welcome Back, Max!’—and there’s my dog leading the pack with a silly bandana someone made. I basically melted on the sidewalk.",
        "I donated a bunch of novels from my teaching days to the local library. Months later this teen walks up to me, almost crying, holding one of my old paperbacks. Inside she found the lesson plan I’d used—covered in handwritten notes I’d left for my students, like ‘Brilliant idea—run with it!’ She says it felt like the words were aimed right at her, so now we grab coffee once a week and geek out over books together.",
        "I texted my brother a photo of the medal I finally won after years of trying. He heart-reacted…and then immediately deleted the reaction. No follow-up, no words. Still haven’t heard from him.",
        "We took the same group pic on three phones at once. Two photos match perfectly; the third is identical except my drink’s half-gone and my friend’s jacket is suddenly zipped. None of us remember moving an inch.",
        "Woke up to a $250 Venmo from a stranger labeled ‘Thanks for the night!’ I panicked thinking my account was hacked, but turns out the sender fat-fingered one digit of his buddy’s handle. I refunded him, Venmo flagged it as ‘good faith,’ and they credited me a $10 convenience bonus for fixing it."
    ]
  }